In [3]:
import pandas as pd
s = pd.Series(list('adfasdffdsaddfasdfasdfsdsafsafafdsafdsadfdsafasdfadsf'))
s.head()

0    a
1    d
2    f
3    a
4    s
dtype: object

# Mostrando os valores únicos

In [4]:
s.unique()

array(['a', 'd', 'f', 's'], dtype=object)

# Contando os valores repetidos

In [6]:
s.value_counts()

d    14
f    14
a    13
s    12
dtype: int64

# Trabalhando com o banco de dados real

In [8]:
dados = pd.read_csv('dados/aluguel.csv', sep = ';')
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
2,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
3,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,21.43,Apartamento
4,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,16.67,Apartamento

In [9]:
dados.Tipo.unique()

array(['Apartamento', 'Casa', 'Casa de Condomínio', 'Casa de Vila',
       'Quitinete'], dtype=object)

In [10]:
dados.Tipo.value_counts()

Apartamento           16923
Casa de Condomínio      964
Casa                    898
Quitinete               813
Casa de Vila            233
Name: Tipo, dtype: int64